export default [
  {
    edition: '0.0.16',
    changeDate: '2020-02-11',
    list: [
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题'
    ]
  },
  {
    edition: '0.0.16',
    changeDate: '2020-02-11',
    list: [
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题'
    ]
  },
  {
    edition: '0.0.16',
    changeDate: '2020-02-11',
    list: [
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题'
    ]
  },
  {
    edition: '0.0.16',
    changeDate: '2020-02-11',
    list: [
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题',
      '修复 调整模拟器窗口大小操作时鼠标指针在模拟器窗口内释放后会失效的问题'
    ]
  }
]
